bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/std_drv/src/bl702l_spi.c
    spiIntCbfArra[spiNo][intType] = cbFun;

    return SUCCESS;
}
#endif

/****************************************************************************/ /**
 * @brief  SPI send datas
 *
 * @param  spiNo: SPI ID type
 * @param  buff: Buffer of datas
 * @param  length: Length of buffer
 * @param  timeoutType: Enable or disable timeout judgment
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type SPI_SendData(SPI_ID_Type spiNo, void *buff, uint32_t length, SPI_Timeout_Type timeoutType)
{
    uint32_t tmpVal, tx_data;
    uint32_t spixBase = spiAddr[spiNo];
    uint32_t timeoutCnt = SPI_RX_TIMEOUT_COUNT;
    uint8_t fifo_cnt, frameSize;

    /* Check the parameters */
    CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));
    CHECK_PARAM(IS_SPI_TIMEOUT_TYPE(timeoutType));

    /* Get fifo valid width */
    tmpVal = BL_RD_REG(spixBase, SPI_CONFIG);
    frameSize = BL_GET_REG_BITS_VAL(tmpVal, SPI_CR_SPI_FRAME_SIZE) + 1;
    if (frameSize == 3) {
        frameSize = 4;
    }

    /* ready to clear rx fifo */
    tmpVal = BL_RD_REG(spixBase, SPI_FIFO_CONFIG_0);
    tmpVal = BL_SET_REG_BIT(tmpVal, SPI_RX_FIFO_CLR);

    for (; length > 0;) {
        /* get tx fifo cnt */
        fifo_cnt = SPI_GetTxFifoCount(spiNo) / frameSize;

        if (fifo_cnt) {
            fifo_cnt = fifo_cnt > length ? length : fifo_cnt;
            length -= fifo_cnt;
            timeoutCnt = SPI_TX_TIMEOUT_COUNT;
        } else {
            if (timeoutType) {
                timeoutCnt--;
                if (timeoutCnt == 0) {
                    return TIMEOUT;
                }
            }
            continue;
        }
        /* clear rx fifo */
        BL_WR_REG(spixBase, SPI_FIFO_CONFIG_0, tmpVal);
        /* write to tx fifo */
        for (; fifo_cnt > 0; fifo_cnt--) {
            switch (frameSize) {
                case 1:
                    BL_WR_REG(spixBase, SPI_FIFO_WDATA, *(uint8_t *)buff);
                    buff++;
                    break;
                case 2:
                    tx_data = *(uint8_t *)buff | *(uint8_t *)(buff + 1) << 8;
                    BL_WR_REG(spixBase, SPI_FIFO_WDATA, tx_data);
                    buff += 2;
                    break;
                case 3:
                case 4:
                    tx_data = BL_RDWD_FRM_BYTEP(((uint8_t *)buff));
                    BL_WR_REG(spixBase, SPI_FIFO_WDATA, tx_data);
                    buff += 4;
                    break;
                default:
                    return INVALID;
                    break;
            }
        }
    }
    /* Waiting for sending to end, supported slave mode */
    while (SPI_GetBusyStatus(spiNo) == SET || SPI_GetTxFifoCount(spiNo) < SPI_FIFO_LEN) {
        if (timeoutType) {
            timeoutCnt--;
            if (timeoutCnt == 0) {
                return TIMEOUT;
            }
        }
    }
    /* clear rx fifo */
    BL_WR_REG(spixBase, SPI_FIFO_CONFIG_0, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  SPI receive datas
 *
 * @param  spiNo: SPI ID type
 * @param  buff: Buffer of datas
 * @param  length: Length of buffer
 * @param  timeoutType: Enable or disable timeout judgment
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type SPI_ReceiveData(SPI_ID_Type spiNo, void *recvBuff, uint32_t length, SPI_Timeout_Type timeoutType)
{
    uint32_t tmpVal;
    uint32_t spixBase = spiAddr[spiNo];
    uint32_t timeoutCnt = SPI_RX_TIMEOUT_COUNT;
    uint32_t tx_cnt = length;
    uint8_t fifo_cnt, frameSize;
    SPI_WORK_MODE_Type spi_mode;

    /* Check the parameters */
    CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));
    CHECK_PARAM(IS_SPI_TIMEOUT_TYPE(timeoutType));

    /* Get fifo valid width and spi mode */
    tmpVal = BL_RD_REG(spixBase, SPI_CONFIG);
    frameSize = BL_GET_REG_BITS_VAL(tmpVal, SPI_CR_SPI_FRAME_SIZE) + 1;
    if (frameSize == 3) {
        frameSize = 4;
    }
    spi_mode = BL_IS_REG_BIT_SET(tmpVal, SPI_CR_SPI_S_EN) ? SPI_WORK_MODE_SLAVE : SPI_WORK_MODE_MASTER;

    if (spi_mode == SPI_WORK_MODE_MASTER) {
        /* clear tx/rx fifo when master mode */
        tmpVal = BL_RD_REG(spixBase, SPI_FIFO_CONFIG_0);
        tmpVal = BL_SET_REG_BIT(tmpVal, SPI_TX_FIFO_CLR);
        tmpVal = BL_SET_REG_BIT(tmpVal, SPI_RX_FIFO_CLR);
        BL_WR_REG(spixBase, SPI_FIFO_CONFIG_0, tmpVal);

        /* first fill tx fifo when master mode */
        fifo_cnt = SPI_GetTxFifoCount(spiNo) / frameSize;
        fifo_cnt = fifo_cnt > length ? length : fifo_cnt;
        tx_cnt -= fifo_cnt;
        for (; fifo_cnt > 0; fifo_cnt--) {
            BL_WR_REG(spixBase, SPI_FIFO_WDATA, 0xFFFFFFFF);
        }
    }

    /* read and write data */
    for (; length > 0;) {
        /* get rx fifo cnt */
        fifo_cnt = SPI_GetRxFifoCount(spiNo) / frameSize;

        if (fifo_cnt) {
            fifo_cnt = fifo_cnt > length ? length : fifo_cnt;
            length -= fifo_cnt;
            timeoutCnt = SPI_TX_TIMEOUT_COUNT;
        } else {
            if (timeoutType) {
                timeoutCnt--;
                if (timeoutCnt == 0) {
                    return TIMEOUT;
                }
            }
            continue;
        }

        /* read and write data */
        for (; fifo_cnt > 0; fifo_cnt--) {
            switch (frameSize) {
                case 1:
                    *(uint8_t *)recvBuff = (uint8_t)BL_RD_REG(spixBase, SPI_FIFO_RDATA);
                    recvBuff++;
                    break;
                case 2:
                    tmpVal = BL_RD_REG(spixBase, SPI_FIFO_RDATA);
                    *(uint8_t *)recvBuff = (uint8_t)tmpVal;
                    *(uint8_t *)(recvBuff + 1) = (uint8_t)(tmpVal >> 8);
                    recvBuff += 2;
                    break;
                case 3:
                case 4:
                    tmpVal = BL_RD_REG(spixBase, SPI_FIFO_RDATA);
                    *(uint8_t *)recvBuff = (uint8_t)tmpVal;
                    *(uint8_t *)(recvBuff + 1) = (uint8_t)(tmpVal >> 8);
                    *(uint8_t *)(recvBuff + 2) = (uint8_t)(tmpVal >> 16);
                    *(uint8_t *)(recvBuff + 3) = (uint8_t)(tmpVal >> 24);
                    recvBuff += 4;
                    break;
                default:
                    return INVALID;
                    break;
            }
            if (spi_mode == SPI_WORK_MODE_MASTER && tx_cnt) {
                BL_WR_REG(spixBase, SPI_FIFO_WDATA, 0xFFFFFFFF);
                tx_cnt--;
            }
        }
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  SPI send and receive datas at the same time
 *
 * @param  spiNo: SPI ID type
 * @param  sendBuff: Buffer of datas to send
 * @param  recvBuff: Buffer of datas received
 * @param  length: Length of buffer
 * @param  timeoutType: Enable or disable timeout judgment
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type SPI_SendRecvData(SPI_ID_Type spiNo, void *sendBuff, void *recvBuff, uint32_t length, SPI_Timeout_Type timeoutType)
{
    uint32_t tmpVal;
    uint32_t spixBase = spiAddr[spiNo];
    uint32_t timeoutCnt = SPI_RX_TIMEOUT_COUNT;
    uint32_t tx_cnt = length;
    uint8_t fifo_cnt, frameSize;

    /* Check the parameters */
    CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));
    CHECK_PARAM(IS_SPI_TIMEOUT_TYPE(timeoutType));

    /* Get fifo valid width */
    tmpVal = BL_RD_REG(spixBase, SPI_CONFIG);
    frameSize = BL_GET_REG_BITS_VAL(tmpVal, SPI_CR_SPI_FRAME_SIZE) + 1;
    if (frameSize == 3) {
        frameSize = 4;
    }

    /* clear tx/rx fifo */
    tmpVal = BL_RD_REG(spixBase, SPI_FIFO_CONFIG_0);
    tmpVal = BL_SET_REG_BIT(tmpVal, SPI_RX_FIFO_CLR);
    tmpVal = BL_SET_REG_BIT(tmpVal, SPI_TX_FIFO_CLR);
    BL_WR_REG(spixBase, SPI_FIFO_CONFIG_0, tmpVal);

    /* First fill tx fifo */
    fifo_cnt = SPI_GetTxFifoCount(spiNo) / frameSize;
    fifo_cnt = fifo_cnt > length ? length : fifo_cnt;
    tx_cnt -= fifo_cnt;
    for (; fifo_cnt > 0; fifo_cnt--) {
        switch (frameSize) {
            case 1:
                BL_WR_REG(spixBase, SPI_FIFO_WDATA, *(uint8_t *)sendBuff);
                sendBuff++;
                break;
            case 2:
                tmpVal = *(uint8_t *)sendBuff | *(uint8_t *)(sendBuff + 1) << 8;
                BL_WR_REG(spixBase, SPI_FIFO_WDATA, tmpVal);
                sendBuff += 2;
                break;
            case 3:
            case 4:
                tmpVal = BL_RDWD_FRM_BYTEP(((uint8_t *)sendBuff));
                BL_WR_REG(spixBase, SPI_FIFO_WDATA, tmpVal);
                sendBuff += 4;
                break;
            default:
                return INVALID;
                break;
        }
    }

    /* read and write rest of the data */
    for (; length > 0;) {
        /* get rx fifo cnt */
        fifo_cnt = SPI_GetRxFifoCount(spiNo) / frameSize;

        if (fifo_cnt) {
            fifo_cnt = fifo_cnt > length ? length : fifo_cnt;
            length -= fifo_cnt;
            timeoutCnt = SPI_TX_TIMEOUT_COUNT;
        } else {
            if (timeoutType) {
                timeoutCnt--;
                if (timeoutCnt == 0) {
                    return TIMEOUT;
                }
            }
            continue;
        }

        /* read and write data */
        for (; fifo_cnt > 0; fifo_cnt--) {
            switch (frameSize) {
                case 1:
                    *((uint8_t *)recvBuff++) = (uint8_t)BL_RD_REG(spixBase, SPI_FIFO_RDATA);
                    if (tx_cnt) {
                        BL_WR_REG(spixBase, SPI_FIFO_WDATA, *(uint8_t *)sendBuff);
                        sendBuff++;
                        tx_cnt--;
                    }
                    break;
                case 2:
                    tmpVal = BL_RD_REG(spixBase, SPI_FIFO_RDATA);
                    *((uint8_t *)recvBuff++) = (uint8_t)tmpVal;
                    *((uint8_t *)recvBuff++) = (uint8_t)(tmpVal >> 8);
                    if (tx_cnt) {
                        tmpVal = *(uint8_t *)sendBuff | *((uint8_t *)sendBuff + 1) << 8;
                        BL_WR_REG(spixBase, SPI_FIFO_WDATA, tmpVal);
                        sendBuff += 2;
                        tx_cnt--;
                    }
                    break;
                case 3:
                case 4:
                    tmpVal = BL_RD_REG(spixBase, SPI_FIFO_RDATA);
                    *((uint8_t *)recvBuff++) = (uint8_t)tmpVal;
                    *((uint8_t *)recvBuff++) = (uint8_t)(tmpVal >> 8);
                    *((uint8_t *)recvBuff++) = (uint8_t)(tmpVal >> 16);
                    *((uint8_t *)recvBuff++) = (uint8_t)(tmpVal >> 24);
                    if (tx_cnt) {
                        tmpVal = BL_RDWD_FRM_BYTEP(((uint8_t *)sendBuff));
                        BL_WR_REG(spixBase, SPI_FIFO_WDATA, tmpVal);
                        sendBuff += 4;
                        tx_cnt--;
                    }
                    break;
                default:
                    return INVALID;
                    break;
            }
        }
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Get tx fifo available count value function
 *
 * @param  spiNo: SPI ID type
 *
 * @return Count value
 *
*******************************************************************************/
uint8_t SPI_GetTxFifoCount(SPI_ID_Type spiNo)
{
    uint32_t SPIx = spiAddr[spiNo];

    /* Check the parameters */
    CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));

